# 2月1日
## Doing
今日出去见了老师同学，于是没有敲代码，只是继续看了网上文章的源码解读以及MVCC的论文
## Todo
明天开始阅读nebula存储部分的源码，争取将storage部分读懂，并且看完剩下两篇相关论文，列出可行的实现方案或方案组合


# 1月31日
完成nebula graph的本地编译以及使用客户端连接运行：编译总共花了8小时，考虑到之后可能会修改存储的数据的原始结构以及查询语言的parser，需要思考如何能优化这样的cpp工程的编译问题。
同时，由于使用docker挂载方式进行编译，我的目录与编译产物shell的目录不同，修改了半天shell文件才成功运行，后续也可以做调整。
今日还遇到了宿主机连接docker上运行的服务i/o超时问题，暂时未能解决，转为将console放到linux环境下运行的方式，访问localhost解决。但之后如果要多机部署，可能需要考虑这个问题。

读论文方面：
精读并总结《An Empirical Evaluation of In-Memory Multi-Version Concurrency Control》这篇综述文章，里面介绍了关于MVCC的协议、存储方式、GC、索引编排等方面的内容。
考虑从中选取适合的模式进行组合来更好地针对属性图实现不同隔离等级下的事务。


# 1月30日
下载nebula源码，找到编译镜像，本地安装环境，配置硬件。
继续看论文，学习MVCC实现以及现有的图数据库事务实现，思考对于属性图应该用什么数据结构处理多版本存储，以及考虑写时复制与MVCC来处理并发冲突的问题。





